#+PROPERTY: header-args:python :session *python*
Declare variables:
#+begin_src python
v1 = 18587
v2 = 16094
v3 = 18858
v4 = 19195
v5 = 16836
v6 = 18301
#+end_src

#+RESULTS:

We multiply the probability of getting a dominant phenotype offspring by the number of pairs in the population
#+begin_src python
pv1 = v1 * 1
pv2 = v2 * 1
pv3 = v3 * 1
pv4 = v4 * .75
pv5 = v5 * .5
pv6 = v6 * 0
#+end_src

#+RESULTS:

So the expectation value for this population if each couple had two children is

#+begin_src python
2 * (pv1 + pv2 + pv3 + pv4 + pv5 + pv6)

#+end_src

#+RESULTS:
: 152706.5
